package ko.alliex.energy.framework.enums;

public enum EMasterType {
    /** 稼働 */
    KB0001,

    /** 区分 */
    KB0002,

    /** パネル設置場所 */
    KB0003,

    /** サイズ */
    KB0004,

    /** 変更 */
    KB0005,

    /** 認定取り消し */
    KB0006,

    /** 上場有無 */
    KB0007,

    /** 電力会社 */
    KB0008,

    /** 法人個人 */
    KB0009,

    /** 業種 */
    KB0010,

    /** 版社チェックレベル */
    KB0011,

    /** マクロ置換マスタ */
    KB0012,

    /** アクション */
    KB0013,

    /** 屋根上水上 */
    KB0014,

    /** OM契約 */
    KB0015,

    /** 合同会社 */
    KB0016,

    /** 編集完了フラグ */
    KB0017,

    /** チェックフラグ */
    KB0018,

    /** マクロステータス実質 */
    KB0019,

    /** マクロステータス */
    KB0020,

    /** 座標入力方法 */
    KB0025,

    /** 業務区分 */
    KB0026,

    /** エクスポートファイル */
    KB0027,

    /** 主任技術者所属会社 */
    KB0028,

    /** 主任技術者種別 */
    KB0029,

    /** 移動時間（片道 ） */
    KB0030,

    /** ガソリン代（片道 ） */
    KB0031,

    /** 高速料金（片道 ） */
    KB0032,

    /** ハザードMAP */
    KB0033,

    /** 塩害地域（※500ｍ重塩害地域、2km塩害地域） */
    KB0034,

    /** PCS種別 */
    KB0035,

    /** 納品写真確認 */
    KB0036,

    /** 企業属性 */
    KB0037,
    ;
}
